Revit 2027 API
BuiltInFailures.GeometryFailures.FailedUpdateCurveChain Property
 Failed to update curve chain.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailedUpdateCurveChain { get; }
Public Shared ReadOnly Property FailedUpdateCurveChain As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailedUpdateCurveChain {
	FailureDefinitionId^ get ();
}
static member FailedUpdateCurveChain : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace